packetqc/AI/STM32N6/AI_TO_NPU_1/run-23/FSBL/Core/Src/main.c
  /* Suppress the BootROM "unsigned-boot" RED LED (LD2 = PG10, active-low): under SWD
   * load_and_run the ROM drives PG10 LOW (LED ON) as a debug signal; a BSRR set-bit flips
   * it HIGH (OFF). Ref N6_EDGEAI_1. */
  __HAL_RCC_GPIOG_CLK_ENABLE();
  GPIOG->BSRR = (1U << 10);

  /* Clear stale pending IRQs the boot ROM / prior boot leave — they re-fire right after
   * load_and_run and fault into uninitialised HAL state. Ref N6_EDGEAI_1. */
  HAL_NVIC_DisableIRQ(TIM2_IRQn);
  HAL_NVIC_ClearPendingIRQ(TIM2_IRQn);
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  /* NPU RAMs were powered in USER CODE 1; enable the M55 caches. */
  // SystemInit_POST();
  g_boot_stage = 3;
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_XSPI1_Init();
  MX_XSPI2_Init();
  MX_BSEC_Init();
  MX_USART1_UART_Init();
  MX_RAMCFG_Init();
  MX_ICACHE_Init();
  MX_CACHEAXI_Init();
  SystemIsolation_Config();
  MX_EXTMEM_MANAGER_Init();
  /* USER CODE BEGIN 2 */
  // NPU_Config();
  g_boot_stage = 4;

  /* AI weights — dev=0/dev=1 UNIFIED load from flash to SRAM (not baked, not XIP). The HW network
   * reads its weights from AXISRAM1 @0x34064000; they are flashed ONCE to XSPI2 NOR @0x70200000
   * (separate from the FSBL image, so they are present at dev=0 — where the baked .ai_weights blob
   * is NOT carried by the signed image). MX_EXTMEM_MANAGER_Init (above) set up the NOR; ensure it is
   * memory-mapped, copy the weights into AXISRAM, then clean the M55 D-cache so the Neural-ART reads
   * fresh weights over its AXI master. SIZE = network_weights.bin (526496 B) — re-flash 0x70200000
   * + update this size if the model changes. */
  (void)EXTMEM_MemoryMappedMode(EXTMEMORY_1, EXTMEM_ENABLE);            /* NOR readable (idempotent) */
  memcpy((void *)0x34064000UL, (const void *)0x70200000UL, 526496UL);  /* flash NOR -> AXISRAM1 */
  SCB_CleanDCache_by_Addr((uint32_t *)0x34064000UL, 526496);           /* NPU sees fresh weights */
  g_boot_stage = 5;

  // RISAF_Config();
  g_boot_stage = 6;

    /* App logic: bring up the NPU calculator model + run one inference. Traced via MCP
   * (g_boot_stage + step). The REPL (UART I/O) is deferred per focus. */
  /* LLM_FSBL_Init();  ...one inference... */
  g_boot_stage = 7;

  /* LEDS */
  {
    (void)BSP_LED_Init(0U);   /* LED_GREEN = LED1 */
    BSP_LED_Off(0U);
    BSP_LED_On (0U);

    (void)BSP_LED_Init(1U);   /* LED_RED = LED2 — error indicator: OFF at init, ON only on error */
    BSP_LED_Off(1U);
  }

  /* COM TERMINAL */
  {
    /* Initialize COM1 port (115200, 8 bits (7-bit data + 1 stop bit), no parity */
    BspCOMInit.BaudRate   = 115200;
    BspCOMInit.WordLength = COM_WORDLENGTH_8B;
    BspCOMInit.StopBits   = COM_STOPBITS_1;
    BspCOMInit.Parity     = COM_PARITY_NONE;
    BspCOMInit.HwFlowCtl  = COM_HWCONTROL_NONE;
    if (BSP_COM_Init(COM1, &BspCOMInit) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }

    printf( "\x1B[2J" );
    printf("%c[0;0H", 0x1b);
    printf("MAIN APP ON\n");
  }

  /* NPU */
  {
    /* NPU peripheral bring-up: clock + reset. Banks were powered in USER CODE 1;
     * RIF master/slave granted in SystemIsolation_Config; CACHEAXI by MX_CACHEAXI_Init.
     * No NPU register access in code yet (smoke-read via MCP). Ref N6_EDGEAI_1. */
    __HAL_RCC_NPU_CLK_ENABLE();
    __HAL_RCC_NPU_FORCE_RESET();
    __HAL_RCC_NPU_RELEASE_RESET();
    /* The RCC/RIF macros are void (no status). Verify the result instead: if the NPU
     * clock did not engage, printf the detail + trigger the error, per the rule. */
    if (__HAL_RCC_NPU_IS_CLK_ENABLED() == 0U)
    {
      printf("NPU clock enable FAILED (RCC AHB5ENR) - boot_stage=%lu\r\n",
             (unsigned long)g_boot_stage);
      Error_Handler();
    }
    g_boot_stage = 8;

    /* NPU performance: keep the RAM/NPU/cache clocks alive in low-power/sleep (the NPU
     * runs async to the M55) + enable the AXI cache so the NPU's weight/activation
     * accesses are cached — without this the NPU runs at software-fallback speed.
     * Mirrors NPU_Validation set_clk_sleep_mode() + npu_cache_enable(). */
    __HAL_RCC_AXISRAM1_MEM_CLK_SLEEP_ENABLE();   __HAL_RCC_AXISRAM2_MEM_CLK_SLEEP_ENABLE();
    __HAL_RCC_AXISRAM3_MEM_CLK_SLEEP_ENABLE();   __HAL_RCC_AXISRAM4_MEM_CLK_SLEEP_ENABLE();
    __HAL_RCC_AXISRAM5_MEM_CLK_SLEEP_ENABLE();   __HAL_RCC_AXISRAM6_MEM_CLK_SLEEP_ENABLE();
    __HAL_RCC_CACHEAXIRAM_MEM_CLK_SLEEP_ENABLE();
    __HAL_RCC_CACHEAXI_CLK_SLEEP_ENABLE();        __HAL_RCC_NPU_CLK_SLEEP_ENABLE();
    { extern void npu_cache_enable(void); npu_cache_enable(); }  /* HAL_CACHEAXI_Enable */

    /* Grant all CIDs RISAF R/W on the NPU memory (AXISRAM weights @0x34064000 +
     * activations) + the NPU masters + NPU cache — without this the NPU epoch stalls
     * reading the weights. Mirrors NPU_Validation set_risaf_default. */
    {
      RISAF_TypeDef *const npu_risafs[] = { RISAF2_S, RISAF4_S, RISAF5_S, RISAF6_S, RISAF8_S };
      RISAF_BaseRegionConfig_t rc;
      memset(&rc, 0, sizeof(rc));
      rc.StartAddress   = 0x0;
      rc.EndAddress     = 0x0FFFFFFF;
      rc.Filtering      = RISAF_FILTER_ENABLE;
      rc.PrivWhitelist  = RIF_CID_NONE;
      rc.ReadWhitelist  = RIF_CID_MASK;
      rc.WriteWhitelist = RIF_CID_MASK;
      for (unsigned i = 0; i < sizeof(npu_risafs) / sizeof(npu_risafs[0]); i++)
      {
        rc.Secure = RIF_ATTRIBUTE_SEC;
        HAL_RIF_RISAF_ConfigBaseRegion(npu_risafs[i], RISAF_REGION_1, &rc);
        rc.Secure = RIF_ATTRIBUTE_NSEC;
        HAL_RIF_RISAF_ConfigBaseRegion(npu_risafs[i], RISAF_REGION_2, &rc);
      }
    }

    printf("NPU clocked + reset OK + AXI cache + RISAF mem (boot_stage=%lu)\r\n", (unsigned long)g_boot_stage);
  }

  /* NPU RUNTIME (global ATON runtime init — MUST run before any network init/run).
   * The --st-neural-art network runs as epoch *blobs* on the NPU epoch controller,
   * whose host sync is interrupt-based (RM0486 §20.3.15-16) and supported ONLY in
   * LL_ATON_RT_ASYNC mode (polling asserts out — ll_aton_runtime.c:132). The runtime
   * init is gated behind stai_runtime_init() (NOT stai_network_init): it enables the
   * ATON interrupt controller and INSTALL+NVIC_EnableIRQ(NPU0_IRQn) so the epoch-end
   * IRQ wakes the runtime's __WFE(). Skipping it = silent WFE stall (init OK, run never
   * returns) — the earlier polling-mode bug. Build sets -DLL_ATON_RT_MODE=ASYNC. */
  {
    stai_return_code rrc = stai_runtime_init();
    if (rrc != STAI_SUCCESS)
    {
      printf("NPU runtime init FAILED (stai rc=%d)\r\n", (int)rrc);
      Error_Handler();
    }
    printf("NPU runtime init OK (ATON INTCTRL + NPU0 IRQ enabled, ISER1=0x%08lX)\r\n",
           (unsigned long)NVIC->ISER[1]);
  }

