packetqc/AI/STM32N6/AI_TO_NPU_1/run-23/FSBL/Core/Src/main.c
  /* NPU MODEL */
  {
    /* Initialize the TCN model context (STAI). Inputs/outputs/weights are preallocated
     * in network.c / network_data.c and placed by the custom linker. */
    g_network = (stai_network *)s_network_ctx;
    stai_return_code rc = stai_network_init(g_network);
    if (rc != STAI_SUCCESS)
    {
      printf("NPU model init FAILED (stai rc=%d) - boot_stage=%lu\r\n",
             (int)rc, (unsigned long)g_boot_stage);
      Error_Handler();
    }
    g_boot_stage = 9;
    printf("NPU HW model init OK (ctx=%u B, weights @0x34064000)\r\n",
           (unsigned)STAI_NETWORK_CONTEXT_SIZE);
  }

  /* NPU INFERENCE — boot self-test: prove the Neural-ART path end-to-end on-device. */
  {
    stai_ptr in_buf = NULL, out_buf = NULL;
    stai_size n_in = 0, n_out = 0;
    stai_network_get_inputs(g_network, &in_buf, &n_in);
    stai_network_get_outputs(g_network, &out_buf, &n_out);
    if (in_buf == NULL || out_buf == NULL)
    {
      printf("NPU get in/out FAILED\r\n");
      Error_Handler();
    }

    g_boot_stage = 10;
    {
      const char *expr = "3 + 4";
      int ok = 0;
      long res = Grammar_Calc(g_network, (int8_t *)in_buf, (const int8_t *)out_buf, expr, &ok);
      if (ok) printf("\r\nNPU self-test: %s = %ld\r\n", expr, res);
      else    printf("\r\nNPU self-test: %s -> parse failed\r\n", expr);
    }
  }

  /* PSRAM status — mapped early in MX_XSPI1_Init (before the NOR/EXTMEM setup, so the NOR survives
   * the XSPI-manager reset). The NPU demo below is the stability gate: if it still computes (no red
   * LED), the early PSRAM map left XSPI2/NOR + the weights intact. */
  printf("\r\nPSRAM @0x90000000: %s (rc=%d)\r\n",
         (g_psram_rc == 0) ? "mapped + CPU-writable" : "FAILED", g_psram_rc);

  /* LCD: solid background colour (Stage A). Framebuffer layer + LVGL land next, on the mapped PSRAM. */
  LCD_Init();

  /* Autonomous on-chip calculator over the ST-Link VCP (USART1 / huart1). The device does
   * ALL the work — this proves edge autonomy. The host unified runner in `--mode device` is a
   * thin terminal: it pushes an expression and collects the result; the tokenize, parse, evaluate
   * and NPU grammar recall all run HERE on the Cortex-M55 + Neural-ART. Connect directly with
   *   minicom -D /dev/ttyACM0 -b 115200
   * or via the runner (scripts/classes/class_model_runner.py --mode device). */
  {
    stai_ptr rin = NULL, rout = NULL; stai_size rn = 0;
    stai_network_get_inputs(g_network, &rin, &rn);
    stai_network_get_outputs(g_network, &rout, &rn);
    NPU_SetVerbose(0);   /* concise: per-rule [model #N] dialog, no per-token spam */

    /* Per-grammar demo set: the CALCULATOR grammar's test expressions. Each grammar carries its own
     * demo/test inputs; the `/demo` runner command cycles the active grammar's set. (run-23 carries
     * one grammar today; a future grammar would ship its own set.) */
    static const char *const calc_demo[] = { "3 + 4", "12 - 5", "6 * 7", "8 / 2", "9 * 9", "2 * (3 + 4)" };
    const int ndemo = (int)(sizeof(calc_demo) / sizeof(calc_demo[0]));

    /* Interactive CLI over the VCP (minicom -D /dev/ttyACM0 -b 115200), line-buffered, with a built-in
     * `/demo` runner command (orchestration — NOT a nocode grammar; the carried *logic* is the
     * dispatch). Accepts any phrasing: "/demo", "/demo off", "/demo calculator on", "/calculator demo
     * off" — a line containing "demo" toggles the loop (off when it also contains "off"). Anything
     * else is evaluated as an expression on-chip via the nocode dispatch + NPU. Heartbeat (GREEN LED
     * + g_heartbeat) ticks throughout; RED lights only on an error. Demo runs by default at boot. */
    uint32_t hb_last = HAL_GetTick(), demo_last = 0U;
    int di = 0, demo_on = 1;
    char cmd[48]; int cmdn = 0;
    printf("\r\n=== NPU calculator — demo running.  /demo off  ·  /demo on  ·  or type an expression ===\r\n");
    for (;;)
    {
      uint32_t now = HAL_GetTick();
      if (now - hb_last >= 500U) { hb_last = now; BSP_LED_Toggle(LED_GREEN); g_heartbeat++; }  /* heartbeat */

      uint8_t ch;                              /* line-buffered command/expression input (non-blocking) */
      if (HAL_UART_Receive(&huart1, &ch, 1, 0) == HAL_OK) {
        if (ch == '\r' || ch == '\n') {
          cmd[cmdn] = '\0';
          if (cmdn > 0) {
            if (strstr(cmd, "demo") != NULL) {   /* /demo [grammar] [on|off] — orchestration command */
              demo_on  = (strstr(cmd, "off") == NULL);
              demo_last = 0U;
              printf("\r\n[demo %s]\r\n", demo_on ? "on" : "off");
            } else {                             /* evaluate as an expression (the calculator grammar) */
              int ok = 0;
              long res = Grammar_Calc(g_network, (int8_t *)rin, (const int8_t *)rout, cmd, &ok);
              if (ok) printf("\r\n= %ld\r\n", res);
              else  { printf("\r\nparse failed for \"%s\"\r\n", cmd); BSP_LED_On(LED_RED); }
            }
          }
          cmdn = 0;
        } else if (ch == 0x08 || ch == 0x7F) { if (cmdn > 0) { --cmdn; printf("\b \b"); } }
        else if (cmdn < (int)sizeof(cmd) - 1) { cmd[cmdn++] = (char)ch; HAL_UART_Transmit(&huart1, &ch, 1, 100); }
      }

      if (demo_on && (now - demo_last >= 2000U)) {   /* demo cadence: next expression every 2 s (circular) */
        demo_last = now;
        const char *expr = calc_demo[di]; di = (di + 1) % ndemo;
        int ok = 0;
        long res = Grammar_Calc(g_network, (int8_t *)rin, (const int8_t *)rout, expr, &ok);
        if (ok) printf("[hb %lu] %s = %ld\r\n", (unsigned long)g_heartbeat, expr, res);
        else  { printf("[hb %lu] %s -> ERROR\r\n", (unsigned long)g_heartbeat, expr); BSP_LED_On(LED_RED); }
      }
    }
  }
  /* USER CODE END 2 */

  /* Launch the application */
  if (BOOT_OK != BOOT_Application())
  {
    Error_Handler();
  }
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

